Hybrid-Memcached/ex2_result/memtier_12t_16t_default_datasize_4018_cycle_100_result
16        Threads
50        Connections per thread
120       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        13916.16          ---          ---        57.15298        55.55100       107.51900       138.23900     55188.99 
Gets           12.76        12.76         0.00        55.21713        54.78300       100.86300       117.24700        50.88 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      13928.92        12.76         0.00        57.15121        55.55100       107.51900       138.23900     55239.87 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       2.063        0.000
SET      51.711        5.000
SET      52.735       10.000
SET      53.247       15.000
SET      53.759       20.000
SET      54.015       25.000
SET      54.271       30.000
SET      54.783       35.000
SET      55.039       40.000
SET      55.295       45.000
SET      55.551       50.000
SET      55.551       52.500
SET      55.807       55.000
SET      55.807       57.500
SET      56.063       60.000
SET      56.063       62.500
SET      56.319       65.000
SET      56.575       67.500
SET      56.575       70.000
SET      56.831       72.500
SET      57.087       75.000
SET      57.343       76.250
SET      57.343       77.500
SET      57.599       78.750
SET      57.855       80.000
SET      58.111       81.250
SET      58.623       82.500
SET      59.135       83.750
SET      59.647       85.000
SET      60.671       86.250
SET      61.695       87.500
SET      62.463       88.125
SET      63.231       88.750
SET      63.999       89.375
SET      65.023       90.000
SET      66.047       90.625
SET      67.071       91.250
SET      68.095       91.875
SET      69.119       92.500
SET      69.631       93.125
SET      70.143       93.750
SET      70.655       94.062
SET      70.655       94.375
SET      71.167       94.688
SET      71.167       95.000
SET      71.679       95.312
SET      71.679       95.625
SET      72.191       95.938
SET      72.703       96.250
SET      72.703       96.562
SET      73.215       96.875
SET      73.215       97.031
SET      73.727       97.188
SET      73.727       97.344
SET      74.239       97.500
SET      74.239       97.656
SET      74.751       97.812
SET      75.263       97.969
SET      75.775       98.125
SET      76.287       98.281
SET      77.311       98.438
SET      78.847       98.516
SET      80.383       98.594
SET      83.967       98.672
SET     102.399       98.750
SET     104.959       98.828
SET     106.495       98.906
SET     107.519       98.984
SET     108.543       99.062
SET     109.055       99.141
SET     109.567       99.219
SET     110.079       99.258
SET     110.079       99.297
SET     110.591       99.336
SET     110.591       99.375
SET     111.103       99.414
SET     111.615       99.453
SET     111.615       99.492
SET     112.127       99.531
SET     112.127       99.570
SET     112.639       99.609
SET     113.151       99.629
SET     113.151       99.648
SET     113.663       99.668
SET     113.663       99.688
SET     114.175       99.707
SET     114.687       99.727
SET     115.199       99.746
SET     115.711       99.766
SET     116.735       99.785
SET     117.759       99.805
SET     118.783       99.814
SET     119.807       99.824
SET     121.343       99.834
SET     123.391       99.844
SET     125.439       99.854
SET     127.999       99.863
SET     131.071       99.873
SET     134.143       99.883
SET     137.215       99.893
SET     138.239       99.902
SET     139.263       99.907
SET     140.287       99.912
SET     141.311       99.917
SET     141.311       99.922
SET     142.335       99.927
SET     143.359       99.932
SET     143.359       99.937
SET     144.383       99.941
SET     145.407       99.946
SET     145.407       99.951
SET     146.431       99.954
SET     146.431       99.956
SET     147.455       99.958
SET     148.479       99.961
SET     148.479       99.963
SET     149.503       99.966
SET     151.551       99.968
SET     153.599       99.971
SET     159.743       99.973
SET     182.271       99.976
SET     187.391       99.977
SET     272.383       99.978
SET     294.911       99.979
SET     319.487       99.980
SET     342.015       99.982
SET     370.687       99.983
SET     401.407       99.984
SET     432.127       99.985
SET     468.991       99.987
SET     507.903       99.988
SET     528.383       99.988
SET     548.863       99.989
SET     569.343       99.990
SET     593.919       99.990
SET     614.399       99.991
SET     630.783       99.991
SET     655.359       99.992
SET     684.031       99.993
SET     712.703       99.993
SET     741.375       99.994
SET     741.375       99.994
SET     770.047       99.995
SET     774.143       99.995
SET     786.431       99.995
SET     798.719       99.995
SET     815.103       99.996
SET     831.487       99.996
SET     843.775       99.996
SET     868.351       99.997
SET     880.639       99.997
SET     888.831       99.997
SET     905.215       99.997
SET     909.311       99.997
SET     917.503       99.998
SET     921.599       99.998
SET     929.791       99.998
SET     946.175       99.998
SET     950.271       99.998
SET     958.463       99.998
SET     966.655       99.998
SET     966.655       99.999
SET     987.135       99.999
SET     991.231       99.999
SET     991.231       99.999
SET     995.327       99.999
SET     999.423       99.999
SET     999.423       99.999
SET    1003.519       99.999
SET    1007.615       99.999
SET    1011.711       99.999
SET    1011.711       99.999
SET    1011.711       99.999
SET    1028.095       99.999
SET    1028.095       99.999
SET    1032.191       99.999
SET    1032.191       99.999
SET    1032.191      100.000
SET    1040.383      100.000
SET    1040.383      100.000
SET    1044.479      100.000
SET    1044.479      100.000
SET    1044.479      100.000
[...]
SET    1048.575      100.000
SET    1048.575      100.000
---
GET      33.279        0.000
GET      49.407        5.000
GET      50.943       10.000
GET      51.967       15.000
GET      52.479       20.000
GET      52.991       25.000
GET      53.503       30.000
GET      53.759       35.000
GET      54.015       40.000
GET      54.527       45.000
GET      54.783       50.000
GET      54.783       52.500
GET      55.039       55.000
GET      55.039       57.500
GET      55.295       60.000
GET      55.551       62.500
GET      55.551       65.000
GET      55.807       67.500
GET      56.063       70.000
GET      56.319       72.500
GET      56.575       75.000
GET      56.575       76.250
GET      56.575       77.500
GET      56.831       78.750
GET      57.087       80.000
GET      57.087       81.250
GET      57.343       82.500
GET      57.599       83.750
GET      57.599       85.000
GET      57.855       86.250
GET      58.111       87.500
GET      58.367       88.125
GET      58.367       88.750
GET      58.623       89.375
GET      58.879       90.000
GET      58.879       90.625
GET      59.135       91.250
GET      59.391       91.875
GET      59.647       92.500
GET      60.159       93.125
GET      60.415       93.750
GET      60.671       94.062
GET      60.671       94.375
GET      61.183       94.688
GET      61.183       95.000
GET      61.695       95.312
GET      62.207       95.625
GET      62.207       95.938
GET      62.463       96.250
GET      62.975       96.562
GET      63.743       96.875
GET      63.999       97.031
GET      64.255       97.188
GET      64.511       97.344
GET      64.767       97.500
GET      66.047       97.656
GET      66.047       97.812
GET      66.559       97.969
GET      67.071       98.125
GET      67.071       98.281
GET      68.607       98.438
GET      69.631       98.516
GET      71.679       98.594
GET      73.215       98.672
GET      73.727       98.750
GET      82.943       98.828
GET      83.455       98.906
GET     100.863       98.984
GET     104.959       99.062
GET     107.007       99.141
GET     108.543       99.219
GET     108.543       99.258
GET     108.543       99.297
GET     108.543       99.336
GET     109.055       99.375
GET     109.567       99.414
GET     109.567       99.453
GET     110.079       99.492
GET     110.079       99.531
GET     110.079       99.570
GET     110.079       99.609
GET     110.079       99.629
GET     110.079       99.648
GET     110.079       99.668
GET     113.663       99.688
GET     113.663       99.707
GET     113.663       99.727
GET     113.663       99.746
GET     113.663       99.766
GET     113.663       99.785
GET     117.247       99.805
GET     117.247       99.814
GET     117.247       99.824
GET     117.247       99.834
GET     117.247       99.844
GET     117.247       99.854
GET     117.247       99.863
GET     119.295       99.873
GET     119.295       99.883
GET     119.295       99.893
GET     119.295       99.902
GET     119.295       99.907
GET     119.295       99.912
GET     119.295       99.917
GET     119.295       99.922
GET     119.295       99.927
GET     119.295       99.932
GET     119.807       99.937
GET     119.807      100.000
---
WAIT      0.000      100.000